require "./machine/vending_drink"

puts "----------------------------------------------"
puts "[インフォメーション]"
puts "----------------------------------------------"
vm = DrinkVendingMachine.new
puts "----------------------------------------------"
puts "[お金を入れる]" 
puts "----------------------------------------------"
vm.slot_money(1000)
vm.slot_money(1000)
puts "----------------------------------------------"
puts "[コーラを5本買う]"
puts "----------------------------------------------"
vm.buy("coke")
vm.buy("coke")
vm.buy("coke")
vm.buy("coke")
vm.buy("coke")
# puts "----------------------------------------------"
# vm.buy(exit)
puts "----------------------------------------------"
puts "[存在しない商品を買おうとしたとき]"
puts "----------------------------------------------"
vm.buy("cok")
puts "----------------------------------------------"
puts "[コーラを補充する その後購入しようとする]"
puts "----------------------------------------------"
vm.item_charge("coke")
vm.buy("coke")
puts "----------------------------------------------"
puts "[水を５本捨てる その後購入しようとする]"
puts "----------------------------------------------"
vm.item_discard("water")
vm.item_discard("water")
vm.item_discard("water")
vm.item_discard("water")
vm.item_discard("water")
vm.buy("water")
puts "----------------------------------------------"
puts "[現時点の売上を照会する]"
puts "----------------------------------------------"
puts vm.sales
puts "----------------------------------------------"
puts "[coke が買えるか照会する]"
puts "----------------------------------------------"
vm.buyable?("coke")
puts "----------------------------------------------"
puts "[coke を間違えて cok と照会したとき]"
puts "----------------------------------------------"
vm.buyable?("cok")
puts "----------------------------------------------"