require "./machine/vending_drink"

puts "----------------------------------------------"
puts "[インフォメーション]"
puts "----------------------------------------------"
vm = DrinkVendingMachine.new
puts "----------------------------------------------"
puts "[お金を入れる]" 
puts "----------------------------------------------"
vm.slot_money(1000)
vm.slot_money(1000)
puts "----------------------------------------------"
puts "[コーラを5本買う]"
puts "----------------------------------------------"
vm.buy("coke")
vm.buy("coke")
vm.buy("coke")
vm.buy("coke")
vm.buy("coke")
vm.buy("coke")
puts "----------------------------------------------"
puts "[存在しない商品を買おうとしたとき]"
puts "----------------------------------------------"
vm.buy("cok")
puts "----------------------------------------------"